4Alisa/11/AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

4Alisa/11/CommonModules/омКонтрольОстатковСервер/Ext/Module.bsl
&НаСервере
Процедура ПроверитьНаличие(тзСписокТоваров,  Дата, Отказ = ЛОЖЬ) Экспорт
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Т.Товар КАК Товар,
		|	Т.СрокГодности КАК СрокГодности,
		|	Т.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_тзТовары
		|ИЗ
		|	&тзСписокТоваров КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.СрокГодности КАК СрокГодности,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК Количество,
		|	ОстаткиТоваровОстатки.Товар КАК Товар
		|ПОМЕСТИТЬ ВТ_ТОВАРЫ_ОСТАТКИ
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(
		|			&Дата,
		|			Товар В
		|					(ВЫБРАТЬ
		|						ВТ_тзТовары.Товар
		|					ИЗ
		|						ВТ_тзТовары)
		|				И СрокГодности В
		|					(ВЫБРАТЬ
		|						ВТ_тзТовары.СрокГодности
		|					ИЗ
		|						ВТ_тзТовары)) КАК ОстаткиТоваровОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_тзТовары.Товар КАК Товар,
		|	ЕСТЬNULL(ВТ_ТОВАРЫ_ОСТАТКИ.СрокГодности, 0) КАК СрокГодности,
		|	ЕСТЬNULL(ВТ_ТОВАРЫ_ОСТАТКИ.Количество, 0) КАК Количество,
		|	ЕСТЬNULL(ВТ_тзТовары.Количество, 0) КАК КоличествоКСписанию
		|ИЗ
		|	ВТ_тзТовары КАК ВТ_тзТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТОВАРЫ_ОСТАТКИ КАК ВТ_ТОВАРЫ_ОСТАТКИ
		|		ПО ВТ_тзТовары.Товар = ВТ_ТОВАРЫ_ОСТАТКИ.Товар
		|			И ВТ_тзТовары.СрокГодности = ВТ_ТОВАРЫ_ОСТАТКИ.СрокГодности";
	
	Если Дата = Дата('00010101000000') Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Дата,", ",");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Дата", Новый Граница(Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("тзСписокТоваров", тзСписокТоваров);
	РЗапроса = Запрос.Выполнить();
	ВЗапроса = РЗапроса.Выбрать();
	Пока ВЗапроса.Следующий() Цикл
		Если ВЗапроса.Количество = 0 ИЛИ ((ВЗапроса.Количество - ВЗапроса.КоличествоКСписанию) < 0 ) Тогда
					Отказ = ИСТИНА;					
					Сообщить("Не хватает товара для списания: "
							+ Символы.ПС + Строка(ВЗапроса.Товар.Наименование) + " "
							+ Символы.ПС + "Остаток: " + Строка(ВЗапроса.Количество) + " "
							+ Символы.ПС + "Нужно: "  + Строка(ВЗапроса.КоличествоКСписанию) + " "
							);
					Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
